[
  {
    "company": "Prifina",
    "role": "Software Developer (Frontend)",
    "resps": [
      "Created and developed an application capable of receiving and giving information about weather and health, with fully developed algorithms.",
      "Worked with a small, but strong group of developers and designers to create the whole application under the period of three months.",
      "Utilizing personalized API's for health data and 'OpenWeather' for climate information, we successfully merged them to create an innovative application without any financial investment, relying solely on passion and dedication.",
      "Integrated a dynamic landing page meticulously showcasing the intricacies of our idea and its functionality in comprehensive detail.",
      "Through rigorous testing and optimization, we achieved an impressive 80% increase in efficiency, delivering a seamless user experience and valuable insights.",
      "Showcased expertise in diverse development areas, fostering a versatile and adaptable workforce.",
      "Implemented over 20 diverse recommendations for daily actions, offering users a wide range of options to improve their day. Additionally, incorporated more than 30 weather statuses and provided 5 distinct outcomes tailored to user health, ensuring personalized and comprehensive support.",
      "Recognized for accelerated growth and proactive leadership, advancing to further levels of software development.",
      "Created the most exceptional project ever witnessed by the company, according to the company CEO.",
      "Revamped legacy code into a customer-centric UI, earning accolades from company leadership and enhancing user satisfaction.",
      "Implemented an interactive Q&A section within the dashboard, empowering users to find answers to their inquiries efficiently, saving valuable time and resources for both users and support staff.",
      "Demonstrated adeptness in spearheading projects, selecting optimal tech stacks, and consistently delivering project outcomes.",
      "Created a multifunctional dashboard featuring weather and health data, actionable recommendations, air quality graphics, and support for Fahrenheit/Celsius, with accessibility options. Achieved 30% higher engagement and 40% lower bounce rate.",
      "Implemented integration of health parameter technology with the company's application using private APIs, enhancing data connectivity and enabling seamless access to vital health metrics within the system."
    ],
    "date": "Oct 2023 - Dec 2023"
  },
  {

    "company": "Skinstric",
    "role": "Software Developer (Frontend)",
    "resps": [
      "Conducted various A/B tests on product pricing, new subscription models, upsells, and downsells, leading to a boost in the LTV (lifetime value) by 23%.",
      "Wrote accessible React components/features and improved UX, thereby reducing CAC from $450 to $250.",
      "Implemented advanced SEO strategies, including keyword optimization, server side rendering and blog, leading to a 40% increase in organic traffic and elevating the website's ranking on the first page of search results.",
      "Enhanced page responsiveness and accessibility to ensure compatibility across all platforms and devices, leading to a 20% increase in user satisfaction rate.",
      "Collaborated with fellow developers to refine and stay abreast of the latest trends and technologies in frontend development, ensuring the continual improvement of my work.",
      "Spearheaded the migration of Skinstric from WordPress to React in 10 days (one sprint), increasing site speed by 50% resulting in a decreased load time from 8 seconds to 4 seconds and 25% reduction in user bounce rate.",
      "Implemented measures to enhance maintainability, resulting in a notable 30% acceleration in the deployment of new feature updates, thereby bolstering development efficiency and agility.",
      "Stayed updated on industry advancements and emerging technologies to incorporate relevant and cutting-edge content into the application.",
      "Worked in harmony with developers, designers, and the people resposible for the ideas, being able to sintase their idea into code and physical",
      "Monitored and tracked the progress of each student, celebrating milestones and proactively addressing any obstacles to ensure a successful learning journey."
    ],
    "date": "Fev 2023"
  }
]
